# 6.2[32]: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
# Напишите функцию
# - Аргументы: список чисел и границы диапазона
# - Возвращает: список индексов элементов (смотри условие)

# Примеры/Тесты:
# lst1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# <function_name>(lst1, 2, 10) -> [1, 3, 7, 9, 10, 13, 14, 19]
# <function_name>(lst1, 2, 9) -> [1, 3, 7, 10, 13, 19]
# <function_name>(lst1, 0, 6) -> [2, 3, 6, 7, 10, 11, 16]
# (*) Усложнение. Для формирования списка внутри функции используйте Comprehension

# (*) Усложнение. Функция возвращает список кортежей вида: индекс, значение

# Примеры/Тесты:
# lst1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# <function_name>(lst1, 2, 10) -> [(1, 9), (3, 3), (7, 4), (9, 10), (10, 2), (13, 8), (14, 10), (19, 7)]

# создать функцию. 3 агрумента : list, min, max   --> [min, max] включительно
# 1. найти элементы входящие в диапазон. 
#       пробегаемся по списку for i in range(len(list_1))
#                                   if list_1[i] > 1 and list_1[i] < 11
# list_new.append(i)
# 2. выдать их иднекс
# 3. создать новый список. нести туда эти элементы

def search_interval_index(list_1, min, max):
    # list_new = []
    # for i in range(len(list_1)):
        # if list_1[i] >= min and list_1[i] <= max:
        #     list_new.append(i)

        # if list_1[i] >= min and list_1[i] <= max:
        #     list_new.append((i, list_1[i]))

    list_new = [(i, list_1[i]) for i in range(len(list_1)) if list_1[i] >= min and list_1[i] <= max]
    return list_new
lst1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

print(search_interval_index(lst1, 2, 10))